Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Name
The Name class represents the name filter expression.

Tekla.Structures.Filtering.Categories.AssemblyFilterExpressions.Name.#ctor
Initializes a new instance of the Name class.